<a href="https://colab.research.google.com/github/anew0m/ABOOK_Pandas-basic/blob/main/study/05_Handling_Missing_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Handling Missing Data

## 9) fillna, dropna로 결측치 다루기

In [9]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame([])

In [11]:
df.dropna?

In [12]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [13]:
df.dropna?

In [14]:
df.dropna(axis=1, how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [15]:
df.dropna(axis=1, how='any')

       name
0    Alfred
1    Batman
2  Catwoman

In [16]:
df.dropna(axis=0, how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [17]:
df.dropna(axis=0, how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

* axis > '0' 열 , '1' 행

In [18]:
df.fillna?

In [19]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [20]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [21]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}

In [22]:
values

{'A': 0, 'B': 1, 'C': 2, 'D': 3}

In [24]:
df.fillna(value = values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [28]:
df['D'].mean()

2.5

In [29]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [30]:
fill_na_value = df['D'].mean()
fill_na_value

2.5

In [31]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [32]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

In [33]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

In [35]:
df.notnull().sum()

A    1
B    3
C    0
D    4
dtype: int64